app/controllers/comments_controller.rb

  def show
    @poem = Poem.find(params[:poem_id])
    @comment = Comment.find(params[:id])
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @poem = Poem.find(params[:poem_id])
    @comment = @poem.comments.new(comment_params)
    respond_to do |format|
      if @comment.save
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "created_at", "poem_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Cool story bro"], ["created_at", "2014-12-29 19:10:54.652036"], ["poem_id", 1], ["updated_at", "2014-12-29 19:10:54.652036"]]

  def edit
    @poem = Poem.find(params[:poem_id])
    @comment = Comment.find(params[:id])
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 14]]

   def destroy
    @poem = Poem.find(params[:poem_id])
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 10]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 3]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 3]]

  def upvote
    @poem = Poem.find(params[:poem_id])
    @comment = Comment.find(params[:id])
    @comment.upvote
    respond_to do |format|
      if @comment.save
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 10]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "comments" SET "updated_at" = $1, "votes" = $2 WHERE "comments"."id" = 2  [["updated_at", "2014-12-29 20:54:36.181551"], ["votes", -4]]

  def downvote
    @poem = Poem.find(params[:poem_id])
    @comment = Comment.find(params[:id])
    @comment.downvote
    respond_to do |format|
      if @comment.save
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "comments" SET "updated_at" = $1, "votes" = $2 WHERE "comments"."id" = 1  [["updated_at", "2014-12-29 19:10:56.348894"], ["votes", -1]]