app/controllers/poems_controller.rb

  def index
    @poem = Poem.new
    @poems = Poem.all
---
SELECT "poems".* FROM "poems"

  def create
    @poem = Poem.new(poem_params)
    respond_to do |format|
      if @poem.save
---
INSERT INTO "poems" ("content", "created_at", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "Roses are red, violets are blue"], ["created_at", "2014-12-29 19:22:43.710784"], ["title", "Roses"], ["updated_at", "2014-12-29 19:22:43.710784"]]

  def show
    @poem = Poem.find(params[:id])
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @poem = Poem.find(params[:id])
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @poem = Poem.find(params[:id])
    if @poem.update_attributes(poem_params)
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "poems" SET "content" = $1, "title" = $2, "updated_at" = $3 WHERE "poems"."id" = 29  [["content", "Is there life on mars?"], ["title", ""], ["updated_at", "2014-12-29 19:26:55.292493"]]

  def destroy
    @poem = Poem.find(params[:id])
    @poem.destroy
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "poems" WHERE "poems"."id" = $1  [["id", 1]]

  def upvote
    @poem = Poem.find(params[:id])
    @poem.upvote
    respond_to do |format|
      if @poem.save
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "poems" SET "updated_at" = $1, "votes" = $2 WHERE "poems"."id" = 1  [["updated_at", "2014-12-29 19:09:17.569137"], ["votes", 1]]

  def downvote
    @poem = Poem.find(params[:id])
    @poem.downvote
    respond_to do |format|
      if @poem.save
---
SELECT  "poems".* FROM "poems"  WHERE "poems"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "poems" SET "updated_at" = $1, "votes" = $2 WHERE "poems"."id" = 1  [["updated_at", "2014-12-29 19:09:18.814867"], ["votes", 2]]

  def search
    @results = Poem.where("#{:title} LIKE (?)", "%#{params[:title]}%")
---
SELECT "poems".* FROM "poems"  WHERE (title LIKE ('%la%'))