app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
  def index
    @question = Question.new
    @questions = Question.all

INSERT INTO "questions" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "What?"], ["created_at", "2014-12-29 18:26:06.392101"], ["updated_at", "2014-12-29 18:26:06.392101"]]
---
  def create
    @question = Question.new(question_params)
    respond_to do |format|
      if @question.save

SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "questions" SET "updated_at" = $1, "votes" = $2 WHERE "questions"."id" = 1  [["updated_at", "2014-12-29 18:26:08.435869"], ["votes", 1]]
---
  def upvote
    @question = Question.find(params[:id])
    @question.upvote
    respond_to do |format|
      if @question.save